<a href="https://colab.research.google.com/github/Santanukolkata/Data_Science/blob/master/Pandas/Panda_partitioning_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import pandas as pd
import numpy as np
np.random.seed(100)
df = pd.DataFrame({'value': np.random.randint(0, 100, 10)})

In [11]:
labels = ["{0} - {1}".format(i, i + 9) for i in range(0, 100, 10)]

In [12]:
labels

['0 - 9',
 '10 - 19',
 '20 - 29',
 '30 - 39',
 '40 - 49',
 '50 - 59',
 '60 - 69',
 '70 - 79',
 '80 - 89',
 '90 - 99']

In [13]:
df['group'] = pd.cut(df.value, range(0, 101, 10), right=False, labels=labels)
df

   value    group
0      8    0 - 9
1     24  20 - 29
2     67  60 - 69
3     87  80 - 89
4     79  70 - 79
5     48  40 - 49
6     10  10 - 19
7     94  90 - 99
8     52  50 - 59
9     98  90 - 99

In [14]:
dict={'Name':['U001','U002','U003','U004','U005','U006','U007'],
      'Department':['D001','D001','D001','D002','D002','D003','D003'],
      'Salary':[10000,11000,9000,7000,5000,8000,8000],
      'Joining Date':['2000-01-01','2000-12-01','2003-01-01','2010-01-01','2015-01-01','2013-01-01','2014-01-01']}

In [16]:
df=pd.DataFrame(dict)
df

   Name Department  Salary Joining Date
0  U001       D001   10000   2000-01-01
1  U002       D001   11000   2000-12-01
2  U003       D001    9000   2003-01-01
3  U004       D002    7000   2010-01-01
4  U005       D002    5000   2015-01-01
5  U006       D003    8000   2013-01-01
6  U007       D003    8000   2014-01-01

In [20]:
m_labels = range(1, 4)
# Assign these labels to three equal percentile groups 
m_groups = pd.qcut(df['Salary'], q=3, labels=m_labels)
# Create new column M
data = df.assign(M = m_groups.values)
data

   Name Department  Salary Joining Date  M
0  U001       D001   10000   2000-01-01  3
1  U002       D001   11000   2000-12-01  3
2  U003       D001    9000   2003-01-01  2
3  U004       D002    7000   2010-01-01  1
4  U005       D002    5000   2015-01-01  1
5  U006       D003    8000   2013-01-01  1
6  U007       D003    8000   2014-01-01  1